Description: Downloads the latest version of Rectangle and makes a pkg of it. Derived from com.github.dataJAR-recipes.download.Rectangle XML recipe
Identifier: com.github.salesloft.download.rectangle
MinimumVersion: "2.3"

Input:
  NAME: Rectangle
  PRERELEASE:

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: rxhanson/Rectangle
      include_prereleases: "%PRERELEASE%"
      asset_regex: '[\S]+\.dmg'

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.dmg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Rectangle.app"
      requirement: anchor apple generic and identifier "com.knollsoft.Rectangle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XSYZ3E4B7D)

  - Processor: EndOfCheckPhase