Description: Downloads the latest version of Slack and makes a pkg of it.
Identifier: com.local.salesloft.download.slack
MinimumVersion: "2.3"

Input:
  NAME: Slack
  DOWNLOAD_URL: https://slack.com/ssb/download-osx-universal

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%DOWNLOAD_URL%"

  - Processor: CodeSignatureVerifier
    Arguments:
      requirement: identifier "com.tinyspeck.slackmacgap" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BQR82RBBHL
      input_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Slack.app"

  - Processor: EndOfCheckPhase