Description: Downloads the latest version of the Slack.dmg and creates a package.
Identifier: com.local.salesloft.pkg.slack
ParentRecipe: com.local.salesloft.download.slack
MinimumVersion: "2.3"

Input:
  NAME: Slack
  PKG_ID: com.tinyspeck.slackmacgap

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/Slack.app"
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Slack.app"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%PKG_ID%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        options: purge_ds_store
      pkgname: "%NAME%-%version%"
