Description: Downloads the latest version of the Zoom package and renames the package.
Identifier: com.local.salesloft.pkg.zoom
ParentRecipe: com.local.salesloft.download.zoom
MinimumVersion: "2.3"

Input:
  BUNDLE_ID: us.zoom.xos
  NAME: Zoom

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/zoomus.pkg/Payload"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications/zoom.us.app/Contents/Info.plist"
      plist_keys:
        CFBundleVersion: version
        CFBundleShortVersionString: jamfversion
        LSMinimumSystemVersion: min_os_version

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%BUNDLE_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        scripts: scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/expanded"