<?xml version="1.0" encoding="UTF-8"?>
<policy>
  <general>
    <name>%POLICY_NAME%</name>
    <enabled>false</enabled>
    <trigger>EVENT</trigger>
    <trigger_other>%POLICY_TRIGGER%</trigger_other>
    <frequency>Ongoing</frequency>
    <category>
      <name>%POLICY_CATEGORY%</name>
    </category>
  </general>
  <scope>
    <all_computers>true</all_computers>
    <computers/>
    <computer_groups>
    </computer_groups>
    <exclusions>
    </exclusions>
  </scope>
  <self_service>
    <use_for_self_service>false</use_for_self_service>
  </self_service>
  <package_configuration>
    <packages>
      <size>1</size>
      <package>
        <name>%pkg_name%</name>
        <action>Install</action>
      </package>
    </packages>
  </package_configuration>
  <scripts>
    <size>1</size>
      <script>
        <name>%POLICY_SCRIPT_NAME%</name>
        <priority>%POLICY_SCRIPT_PRIORITY%</priority>
        <parameter4>%POLICY_SCRIPT_PRAM04%</parameter4>
        <parameter5>%POLICY_SCRIPT_PRAM05%</parameter5>
        <parameter6>%POLICY_SCRIPT_PRAM06%</parameter6>
        <parameter7>%POLICY_SCRIPT_PRAM07%</parameter7>
        <parameter8>%POLICY_SCRIPT_PRAM08%</parameter8>
        <parameter9>%POLICY_SCRIPT_PRAM09%</parameter9>
        <parameter10>%POLICY_SCRIPT_PRAM10%</parameter10>
        <parameter11>%POLICY_SCRIPT_PRAM11%</parameter11>
      </script>
  </scripts>
  <maintenance>
    <recon>true</recon>
  </maintenance>
</policy>