<?xml version="1.0" encoding="UTF-8"?>
<policy>
  <general>
    <name>%POLICY_NAME%</name>
    <enabled>false</enabled>
    <trigger>EVENT</trigger>
    <trigger_other>%POLICY_TRIGGER%</trigger_other>
    <frequency>Ongoing</frequency>
    <category>
      <name>%POLICY_CATEGORY%</name>
    </category>
  </general>
  <scope>
    <all_computers>true</all_computers>
    <computers/>
    <computer_groups>
    </computer_groups>
    <exclusions>
    </exclusions>
  </scope>
  <self_service>
    <use_for_self_service>false</use_for_self_service>
  </self_service>
  <package_configuration>
    <packages>
      <size>1</size>
      <package>
        <name>%pkg_name%</name>
        <action>Install</action>
      </package>
    </packages>
  </package_configuration>
  <scripts>
    <size>1</size>
      <script>
        <name>%POLICY_SCRIPT_NAME%</name>
        <priority>%POLICY_SCRIPT_PRIORITY%</priority>
      </script>
  </scripts>
  <maintenance>
    <recon>true</recon>
  </maintenance>
</policy>