Description: Downloads the latest version of the Google Chrome.dmg and creates a package.
Identifier: com.local.salesloft.pkg.googlechrome
ParentRecipe: com.local.salesloft.download.googlechrome
MinimumVersion: "2.3"

Input:
  NAME: Google Chrome

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        version: "%version%"
        options: purge_ds_store
      pkgname: "%NAME%-%version%"
