Description: Downloads the latest version of Google Chrome and makes a pkg of it.
Identifier: com.local.salesloft.download.googlechrome
MinimumVersion: "2.3"

Input:
  NAME: Google Chrome
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%DOWNLOAD_URL%"

  - Processor: CodeSignatureVerifier
    Arguments:
      requirement: (identifier "com.google.Chrome" or identifier "com.google.Chrome.beta" or identifier "com.google.Chrome.dev" or identifier "com.google.Chrome.canary") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV
      input_path: "%pathname%/Google Chrome.app"

  - Processor: EndOfCheckPhase