Description: Downloads the latest version of 1Password8.
Identifier: com.local.salesloft.download.1password8
MinimumVersion: "2.3"

Input:
  NAME: 1Password
  DOWNLOAD_URL: https://downloads.1password.com/mac/1Password.pkg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.pkg"
      url: "%DOWNLOAD_URL%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: AgileBits Inc. (2BUA8C4S2C)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/com.1Password.1Password.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/Applications'