Comment: YAML recipe to upload 1Password8 client to Jamf.
Identifier: com.local.salesloft.jamf.1password8
ParentRecipe: com.local.salesloft.pkg.1password8
MinimumVersion: '2.3'

Input:
  NAME: 1Password8
  CATEGORY: AutoPkg App Installers
  POLICY_CATEGORY: Applications
  POLICY_NAME: Install %NAME%
  POLICY_TEMPLATE: SelfServiceAllComputersEnabledTemplate.xml
  POLICY_TRIGGER: autoPKG1Pass8
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_DESCRIPTION: |
    ### Version of %NAME% to be installed: %version% 

    **This version of %NAME% will work for both Intel and Apple Silicon Macs.**
    
    1Password 8 is the best password manager and secure vault that keeps your password safe, secure and organized at a single place.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  PKG_VERSIONS: '3'
  PKG_NAME: '1Password'
  PKG_NAME_LENGTH: '3'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    versions_to_keep: '%PKG_VERSIONS%'
    pkg_name_match: '%PKG_NAME%'
    minimum_name_length: '%PKG_NAME_LENGTH%'
